In [52]:
# Avinash  Shiyani
# c-36

In [53]:
# 1
# Create your dataset in CSV file with the following fields.
# Rollno, Name, Gender, English, Maths, Science, Category
# Insert category values as A, B or C. At least insert 15-20 records with some missing
# values in subject marks data and save file as “student_marks.csv”

In [54]:
# 2
# Load the dataset (student_marks.csv) into a pandas DataFrame.
# Display information: number of columns, number of records, name of all columns,
# Also display the type of dataframe and the type of any single column.

import pandas as pd

df = pd.read_csv("student_marks.csv")

print(df)

# pip install pandas

    Rollno        Name  Gender  English  Maths  Science Category
0        1   Student_1    Male     85.0    NaN     78.0        A
1        2   Student_2  Female     78.0   75.0     83.0        C
2        3   Student_3    Male      NaN   92.0      NaN        A
3        4   Student_4    Male     90.0   85.0     91.0        C
4        5   Student_5    Male     88.0   88.0     86.0        C
5        6   Student_6  Female      NaN   81.0     89.0        C
6        7   Student_7    Male     76.0   77.0      NaN        B
7        8   Student_8    Male     80.0    NaN     85.0        B
8        9   Student_9  Female      NaN   94.0     93.0        B
9       10  Student_10    Male     95.0   91.0      NaN        B
10      11  Student_11    Male     82.0    NaN     88.0        C
11      12  Student_12    Male     89.0   78.0     84.0        B
12      13  Student_13  Female      NaN   88.0     91.0        B
13      14  Student_14    Male     77.0   80.0      NaN        C
14      15  Student_15    Male     93.0    NaN     80.0        B
15      16  Student_16  Female      NaN   95.0     87.0        A
16      17  Student_17    Male     85.0   85.0     92.0        B
17      18  Student_18    Male     91.0    NaN      NaN        C
18      19  Student_19    Male      NaN   92.0     86.0        A
19      20  Student_20  Female     87.0   83.0     89.0        B

In [55]:
# 3
# Display the first 4 rows of the DataFrame and Display last 3 rows of the DataFrame

# show first 4 row
df.head(5)

# show last 3 row
df.tail(3)

    Rollno        Name  Gender  English  Maths  Science Category
17      18  Student_18    Male     91.0    NaN      NaN        C
18      19  Student_19    Male      NaN   92.0     86.0        A
19      20  Student_20  Female     87.0   83.0     89.0        B

In [56]:
# 4
# Display student data with Rollno, Name and Science columns only

print(df[["Rollno" , "Name" , "Science"]])
# display specific with fields

    Rollno        Name  Science
0        1   Student_1     78.0
1        2   Student_2     83.0
2        3   Student_3      NaN
3        4   Student_4     91.0
4        5   Student_5     86.0
5        6   Student_6     89.0
6        7   Student_7      NaN
7        8   Student_8     85.0
8        9   Student_9     93.0
9       10  Student_10      NaN
10      11  Student_11     88.0
11      12  Student_12     84.0
12      13  Student_13     91.0
13      14  Student_14      NaN
14      15  Student_15     80.0
15      16  Student_16     87.0
16      17  Student_17     92.0
17      18  Student_18      NaN
18      19  Student_19     86.0
19      20  Student_20     89.0

In [57]:
# 5
# Display the total number of missing values per column. Fill missing marks with the mean
# of the column/subject. Also handle missing values appropriately if exists in any column.
# 6. Display student rows with category ‘B’ or ‘C’

missing_values_count = df.isnull().sum()
print("Total Missing Values per Column:")
print(missing_values_count)

for column in ['English', 'Maths', 'Science']:
    df[column].fillna(df[column].mean(), inplace=True)

remaining_missing_values = df.isnull().sum()
print("\nMissing Values after filling:")
print(remaining_missing_values)

df.fillna({'Name': 'Unknown', 'Category': 'Unknown'}, inplace=True)

# Final check for any remaining missing values
final_missing_values = df.isnull().sum()
print("\nFinal Missing Values:")
print(final_missing_values)

Total Missing Values per Column:
Rollno      0
Name        0
Gender      0
English     6
Maths       5
Science     5
Category    0
dtype: int64

Missing Values after filling:
Rollno      0
Name        0
Gender      0
English     0
Maths       0
Science     0
Category    0
dtype: int64

Final Missing Values:
Rollno      0
Name        0
Gender      0
English     0
Maths       0
Science     0
Category    0
dtype: int64

C:\Users\Avinash\AppData\Local\Temp\ipykernel_3368\2164831097.py:11: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df[column].fillna(df[column].mean(), inplace=True)

In [58]:
# 6 . Display student rows with category ‘B’ or ‘C’.
filtered_students = df[df['Category'].isin(['B', 'C'])]

print(filtered_students)

    Rollno        Name  Gender    English  Maths  Science Category
1        2   Student_2  Female  78.000000   75.0     83.0        C
3        4   Student_4    Male  90.000000   85.0     91.0        C
4        5   Student_5    Male  88.000000   88.0     86.0        C
5        6   Student_6  Female  85.428571   81.0     89.0        C
6        7   Student_7    Male  76.000000   77.0     86.8        B
7        8   Student_8    Male  80.000000   85.6     85.0        B
8        9   Student_9  Female  85.428571   94.0     93.0        B
9       10  Student_10    Male  95.000000   91.0     86.8        B
10      11  Student_11    Male  82.000000   85.6     88.0        C
11      12  Student_12    Male  89.000000   78.0     84.0        B
12      13  Student_13  Female  85.428571   88.0     91.0        B
13      14  Student_14    Male  77.000000   80.0     86.8        C
14      15  Student_15    Male  93.000000   85.6     80.0        B
16      17  Student_17    Male  85.000000   85.0     92.0        B
17      18  Student_18    Male  91.000000   85.6     86.8        C
19      20  Student_20  Female  87.000000   83.0     89.0        B

In [59]:
# 7
# Display student rows whose gender is Female.

df[df['Gender'].isin(["Female"])]

    Rollno        Name  Gender    English  Maths  Science Category
1        2   Student_2  Female  78.000000   75.0     83.0        C
5        6   Student_6  Female  85.428571   81.0     89.0        C
8        9   Student_9  Female  85.428571   94.0     93.0        B
12      13  Student_13  Female  85.428571   88.0     91.0        B
15      16  Student_16  Female  85.428571   95.0     87.0        A
19      20  Student_20  Female  87.000000   83.0     89.0        B

In [3]:
# 8
# Sort all the students by English marks column
import pandas as pd
df = pd.read_csv("student_marks.csv")
df.sort_values(by=["English"], ascending=True)

    Rollno        Name  Gender  English  Maths  Science Category
6        7   Student_7    Male     76.0   77.0      NaN        B
13      14  Student_14    Male     77.0   80.0      NaN        C
1        2   Student_2  Female     78.0   75.0     83.0        C
7        8   Student_8    Male     80.0    NaN     85.0        B
10      11  Student_11    Male     82.0    NaN     88.0        C
0        1   Student_1    Male     85.0    NaN     78.0        A
16      17  Student_17    Male     85.0   85.0     92.0        B
19      20  Student_20  Female     87.0   83.0     89.0        B
4        5   Student_5    Male     88.0   88.0     86.0        C
11      12  Student_12    Male     89.0   78.0     84.0        B
3        4   Student_4    Male     90.0   85.0     91.0        C
17      18  Student_18    Male     91.0    NaN      NaN        C
14      15  Student_15    Male     93.0    NaN     80.0        B
9       10  Student_10    Male     95.0   91.0      NaN        B
2        3   Student_3    Male      NaN   92.0      NaN        A
5        6   Student_6  Female      NaN   81.0     89.0        C
8        9   Student_9  Female      NaN   94.0     93.0        B
12      13  Student_13  Female      NaN   88.0     91.0        B
15      16  Student_16  Female      NaN   95.0     87.0        A
18      19  Student_19    Male      NaN   92.0     86.0        A

In [61]:
# 9
# Display rows of the students who scored more than 80 in Maths

filtered_marks = df[df["Maths"] > 80]
print(filtered_marks)

    Rollno        Name  Gender  English  Maths  Science Category
2        3   Student_3    Male      NaN   92.0      NaN        A
3        4   Student_4    Male     90.0   85.0     91.0        C
4        5   Student_5    Male     88.0   88.0     86.0        C
5        6   Student_6  Female      NaN   81.0     89.0        C
8        9   Student_9  Female      NaN   94.0     93.0        B
9       10  Student_10    Male     95.0   91.0      NaN        B
12      13  Student_13  Female      NaN   88.0     91.0        B
15      16  Student_16  Female      NaN   95.0     87.0        A
16      17  Student_17    Male     85.0   85.0     92.0        B
18      19  Student_19    Male      NaN   92.0     86.0        A
19      20  Student_20  Female     87.0   83.0     89.0        B

In [62]:
# 10
# Find the maximum marks in each subject.
is_max = df[["Maths" , "English" , "Science"]].max()
print(is_max)

Maths      95.0
English    95.0
Science    93.0
dtype: float64

In [63]:
# 11
# Find the minimum marks in each subject
is_min = df[["Maths" , "English" , "Science"]].min()
print(is_min)

Maths      75.0
English    76.0
Science    78.0
dtype: float64

In [64]:
# 12
# Calculate the display the mean (average) marks for each subject
average_marks = df[["Maths" , "English" , "Science"]].mean()
print(average_marks)

Maths      85.600000
English    85.428571
Science    86.800000
dtype: float64

In [8]:
# 13
# Calculate the total marks for each student and add it as a new column as total. Display
# updated DataFrame

df['Total'] = df[['Maths', 'English', 'Science']].sum(axis=1)

# Displaying the updated DataFrame
print(df)

    Rollno        Name  Gender  English  Maths  Science Category  Total
0        1   Student_1    Male     85.0    NaN     78.0        A  163.0
1        2   Student_2  Female     78.0   75.0     83.0        C  236.0
2        3   Student_3    Male      NaN   92.0      NaN        A   92.0
3        4   Student_4    Male     90.0   85.0     91.0        C  266.0
4        5   Student_5    Male     88.0   88.0     86.0        C  262.0
5        6   Student_6  Female      NaN   81.0     89.0        C  170.0
6        7   Student_7    Male     76.0   77.0      NaN        B  153.0
7        8   Student_8    Male     80.0    NaN     85.0        B  165.0
8        9   Student_9  Female      NaN   94.0     93.0        B  187.0
9       10  Student_10    Male     95.0   91.0      NaN        B  186.0
10      11  Student_11    Male     82.0    NaN     88.0        C  170.0
11      12  Student_12    Male     89.0   78.0     84.0        B  251.0
12      13  Student_13  Female      NaN   88.0     91.0        B  179.0
13      14  Student_14    Male     77.0   80.0      NaN        C  157.0
14      15  Student_15    Male     93.0    NaN     80.0        B  173.0
15      16  Student_16  Female      NaN   95.0     87.0        A  182.0
16      17  Student_17    Male     85.0   85.0     92.0        B  262.0
17      18  Student_18    Male     91.0    NaN      NaN        C   91.0
18      19  Student_19    Male      NaN   92.0     86.0        A  178.0
19      20  Student_20  Female     87.0   83.0     89.0        B  259.0

In [10]:
# 14
# Sort all the student rows by descending order of “total” column

sort_data = df.sort_values(by="Total" , ascending=False)
print(sort_data)

    Rollno        Name  Gender  English  Maths  Science Category  Total
3        4   Student_4    Male     90.0   85.0     91.0        C  266.0
4        5   Student_5    Male     88.0   88.0     86.0        C  262.0
16      17  Student_17    Male     85.0   85.0     92.0        B  262.0
19      20  Student_20  Female     87.0   83.0     89.0        B  259.0
11      12  Student_12    Male     89.0   78.0     84.0        B  251.0
1        2   Student_2  Female     78.0   75.0     83.0        C  236.0
8        9   Student_9  Female      NaN   94.0     93.0        B  187.0
9       10  Student_10    Male     95.0   91.0      NaN        B  186.0
15      16  Student_16  Female      NaN   95.0     87.0        A  182.0
12      13  Student_13  Female      NaN   88.0     91.0        B  179.0
18      19  Student_19    Male      NaN   92.0     86.0        A  178.0
14      15  Student_15    Male     93.0    NaN     80.0        B  173.0
10      11  Student_11    Male     82.0    NaN     88.0        C  170.0
5        6   Student_6  Female      NaN   81.0     89.0        C  170.0
7        8   Student_8    Male     80.0    NaN     85.0        B  165.0
0        1   Student_1    Male     85.0    NaN     78.0        A  163.0
13      14  Student_14    Male     77.0   80.0      NaN        C  157.0
6        7   Student_7    Male     76.0   77.0      NaN        B  153.0
2        3   Student_3    Male      NaN   92.0      NaN        A   92.0
17      18  Student_18    Male     91.0    NaN      NaN        C   91.0

In [67]:
# 15
# Display the student rows whose total marks are less than 50

print(df[df["Total"] < 100])

    Rollno        Name Gender  English  Maths  Science Category  Total
2        3   Student_3   Male      NaN   92.0      NaN        A   92.0
17      18  Student_18   Male     91.0    NaN      NaN        C   91.0

In [11]:
# 16
# Find the student with the highest total marks and display their name.
# Find the student with the lowest total marks and display their name. 
import pandas as pd

import pandas as pd

# Load the DataFrame from the CSV
df = pd.read_csv("student_marks.csv")

# Calculate total marks by summing up 'English', 'Maths', and 'Science' columns
df['Total'] = df[['English', 'Maths', 'Science']].sum(axis=1)

top_student = df.loc[df['Total'].idxmax()]
print(f"Top student is {top_student['Name']} with total marks: {top_student['Total']}")


low_student = df.loc[df['Total'].idxmin()]
print(f"Lowest scoring student is {low_student['Name']} with total marks: {low_student['Total']}")

Top student is Student_4 with total marks: 266.0
Lowest scoring student is Student_18 with total marks: 91.0

In [69]:
# 17
# Find the student name with the maximum marks in each subject.
import pandas as pd

# Load the DataFrame from the CSV
df = pd.read_csv("student_marks.csv")

# Find the student with the highest marks in English
top_english_student = df.loc[df['English'].idxmax()]
print(f"Top student in English is {top_english_student['Name']} with {top_english_student['English']} marks")

# Find the student with the highest marks in Maths
top_maths_student = df.loc[df['Maths'].idxmax()]
print(f"Top student in Maths is {top_maths_student['Name']} with {top_maths_student['Maths']} marks")

# Find the student with the highest marks in Science
top_science_student = df.loc[df['Science'].idxmax()]
print(f"Top student in Science is {top_science_student['Name']} with {top_science_student['Science']} marks")

Top student in English is Student_10 with 95.0 marks
Top student in Maths is Student_16 with 95.0 marks
Top student in Science is Student_9 with 93.0 marks

In [70]:
# 18
# Display the gender-wise total number of students.
import pandas as pd

# Load the DataFrame from the CSV
df = pd.read_csv("student_marks.csv")

# Group by 'Gender' and count the number of students in each gender
gender_count = df.groupby('Gender').size()

# Display the result
print(gender_count)

Gender
Female     6
Male      14
dtype: int64

In [71]:
# 19
# Find the number of students in each category (A, B, C) and display the counts for each
# category
import pandas as pd

# Load the DataFrame from the CSV
df = pd.read_csv("student_marks.csv")

# Group by 'Category' and count the number of students in each category
category_count = df.groupby('Category').size()

# Display the result
print(category_count)

Category
A    4
B    9
C    7
dtype: int64

In [72]:
# 20
# Find and display the rows of the top 3 students with the highest total marks.
import pandas as pd

# Load the DataFrame from the CSV
df = pd.read_csv("student_marks.csv")

# Calculate total marks by summing up 'English', 'Maths', and 'Science' columns
df['Total'] = df[['English', 'Maths', 'Science']].sum(axis=1)

# Find the top 3 students with the highest total marks
top_students = df.nlargest(3, 'Total')

# Display the rows of the top 3 students
print(top_students)

    Rollno        Name Gender  English  Maths  Science Category  Total
3        4   Student_4   Male     90.0   85.0     91.0        C  266.0
4        5   Student_5   Male     88.0   88.0     86.0        C  262.0
16      17  Student_17   Male     85.0   85.0     92.0        B  262.0

In [73]:
# 21
# Save a new csv file with name “student_mark_updated.csv” to store updated DataFrame.
# Verify whether the new CSV file is created or not
import pandas as pd
import os

# Load the DataFrame from the CSV
df = pd.read_csv("student_marks.csv")

# Calculate total marks by summing up 'English', 'Maths', and 'Science' columns
df['Total'] = df[['English', 'Maths', 'Science']].sum(axis=1)

# Save the updated DataFrame to a new CSV file
new_file_name = "student_mark_updated.csv"
df.to_csv(new_file_name, index=False)

# Verify if the new CSV file is created
if os.path.exists(new_file_name):
    print(f"The file '{new_file_name}' has been created successfully.")
else:
    print(f"Failed to create the file '{new_file_name}'.")

The file 'student_mark_updated.csv' has been created successfully.

In [12]:
# Download any one dataset (CSV file) of your choice from the internet and Load that
# dataset into a pandas DataFrame. Display description of the data using dataframe.
# Display number of columns and rows.
# https://www.kaggle.com/datasets

import pandas as pd

# Load the dataset into a DataFrame (update the file path as needed)
file_path = "bussiness.csv"  # Replace with the actual path to your CSV file
df = pd.read_csv(file_path)

# Display the description of the DataFrame
print(df.describe())

# Display the number of columns and rows
# print(f"Number of columns: {df.shape[1]}")
# print(f"Number of rows: {df.shape[0]}")

             Period    Data_value  Series_title_3  Series_title_4  \
count  77010.000000  76610.000000             0.0             0.0
mean    2009.196260    950.644098             NaN             NaN
std       10.233531    326.550594             NaN             NaN
min     1977.120000     -5.800000             NaN             NaN
25%     2001.120000    752.000000             NaN             NaN
50%     2011.090000    989.000000             NaN             NaN
75%     2018.030000   1110.000000             NaN             NaN
max     2024.060000   5239.000000             NaN             NaN

       Series_title_5
count             0.0
mean              NaN
std               NaN
min               NaN
25%               NaN
50%               NaN
75%               NaN
max               NaN

C:\Users\Avinash\AppData\Local\Temp\ipykernel_7676\997429978.py:10: DtypeWarning: Columns (8) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv(file_path)